<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 6.0/6.0 MB 77.4 MB/s eta 0:00:00:00:0100:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.9-cp37-cp37m-linux_x86_64.whl size=1159121 sha256=9b3e5e20c6fb74ee4cc4b3dc2e42d3c23b911d6964df0edfe830f47ab46244c1
  Stored in directory: /home/jupyterlab/.cache/pip/wheels/03/71/13/010faf12246f72dc76b4150e6e599d13a85b4435e06fb9e51f
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.24
    Uninstalling SQLAlchemy-1.3.24:
      Successfully uninstalled SQLAlchemy-1.3.24
Successfully installed sqlalchemy-1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [7]:
!pip install -q pandas==1.1.5

In [3]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [4]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

**Note:This below code is added to remove blank rows from table**

In [5]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [14]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('SPACEXTBL');

 * sqlite:///my_data1.db
Done.

[('Date', 'TEXT', 4),
 ('Time (UTC)', 'TEXT', 4),
 ('Booster_Version', 'TEXT', 4),
 ('Launch_Site', 'TEXT', 4),
 ('Payload', 'TEXT', 4),
 ('PAYLOAD_MASS__KG_', 'INTEGER', 7),
 ('Orbit', 'TEXT', 4),
 ('Customer', 'TEXT', 4),
 ('Mission_Outcome', 'TEXT', 4),
 ('Landing_Outcome', 'TEXT', 4)]

In [9]:
%sql select distinct(Launch_Site) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [13]:
%sql select * from SPACEXTBL where Launch_Site Like "%CCA%" Limit 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [23]:
%sql select PAYLOAD__MASS_KG_ from SPACEXTBL where Customer = NASA (CRS)

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such column: PAYLOAD__MASS_KG_
[SQL: select PAYLOAD__MASS_KG_ from SPACEXTBL where Customer = NASA (CRS)]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [29]:
%sql select sum(PAYLOAD_MASS__KG_) as Total_payload_mass_carried from SPACEXTBL  where Customer = 'NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [30]:
%sql select avg(PAYLOAD_MASS__KG_) as Avg_Payload_Mass from SPACEXTBL  where Booster_Version = 'F9 v1.1'

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [38]:
%sql select distinct(Landing_Outcome) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('Failure (parachute)',),
 ('No attempt',),
 ('Uncontrolled (ocean)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Precluded (drone ship)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',)]

In [39]:
%sql select Date,Landing_Outcome,Mission_Outcome from SPACEXTBL where Landing_Outcome = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('2015-12-22', 'Success (ground pad)', 'Success'),
 ('2016-07-18', 'Success (ground pad)', 'Success'),
 ('2017-02-19', 'Success (ground pad)', 'Success'),
 ('2017-05-01', 'Success (ground pad)', 'Success'),
 ('2017-06-03', 'Success (ground pad)', 'Success'),
 ('2017-08-14', 'Success (ground pad)', 'Success'),
 ('2017-09-07', 'Success (ground pad)', 'Success'),
 ('2017-12-15', 'Success (ground pad)', 'Success'),
 ('2018-01-08', 'Success (ground pad)', 'Success (payload status unclear)')]

In [87]:
%sql select count (*) from SPACEXTBL where Landing_Outcome = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[(9,)]

In [40]:
%sql select min(Date) as First_successfull_landing,Landing_Outcome, Mission_Outcome from SPACEXTBL where Landing_Outcome = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('2015-12-22', 'Success (ground pad)', 'Success')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [47]:
%sql select Booster_Version,Landing_Outcome from SPACEXTBL where Landing_Outcome Like '%Drone%'

 * sqlite:///my_data1.db
Done.

[('F9 v1.1 B1012', 'Failure (drone ship)'),
 ('F9 v1.1 B1015', 'Failure (drone ship)'),
 ('F9 v1.1 B1018', 'Precluded (drone ship)'),
 ('F9 v1.1 B1017', 'Failure (drone ship)'),
 ('F9 FT B1020', 'Failure (drone ship)'),
 ('F9 FT B1021.1', 'Success (drone ship)'),
 ('F9 FT B1022', 'Success (drone ship)'),
 ('F9 FT B1023.1', 'Success (drone ship)'),
 ('F9 FT B1024', 'Failure (drone ship)'),
 ('F9 FT B1026', 'Success (drone ship)'),
 ('F9 FT B1029.1', 'Success (drone ship)'),
 ('F9 FT  B1021.2', 'Success (drone ship)'),
 ('F9 FT  B1029.2', 'Success (drone ship)'),
 ('F9 FT B1036.1', 'Success (drone ship)'),
 ('F9 FT B1038.1', 'Success (drone ship)'),
 ('F9 B4 B1041.1', 'Success (drone ship)'),
 ('F9 FT  B1031.2', 'Success (drone ship)'),
 ('F9 B4 B1042.1', 'Success (drone ship)'),
 ('F9 B4 B1045.1', 'Success (drone ship)'),
 ('F9 B5  B1046.1', 'Success (drone ship)')]

In [50]:
%sql select Booster_Version,Landing_Outcome from SPACEXTBL where Landing_Outcome Like '%Drone%' And Landing_Outcome='Success (drone ship)'

 * sqlite:///my_data1.db
Done.

[('F9 FT B1021.1', 'Success (drone ship)'),
 ('F9 FT B1022', 'Success (drone ship)'),
 ('F9 FT B1023.1', 'Success (drone ship)'),
 ('F9 FT B1026', 'Success (drone ship)'),
 ('F9 FT B1029.1', 'Success (drone ship)'),
 ('F9 FT  B1021.2', 'Success (drone ship)'),
 ('F9 FT  B1029.2', 'Success (drone ship)'),
 ('F9 FT B1036.1', 'Success (drone ship)'),
 ('F9 FT B1038.1', 'Success (drone ship)'),
 ('F9 B4 B1041.1', 'Success (drone ship)'),
 ('F9 FT  B1031.2', 'Success (drone ship)'),
 ('F9 B4 B1042.1', 'Success (drone ship)'),
 ('F9 B4 B1045.1', 'Success (drone ship)'),
 ('F9 B5  B1046.1', 'Success (drone ship)')]

In [110]:
%sql select COUNT(*) from SPACEXTBL where Landing_Outcome Like '%Drone%' And Landing_Outcome='Success (drone ship)'

 * sqlite:///my_data1.db
Done.

[(14,)]

In [56]:
%sql select Booster_Version from SPACEXTBL where Landing_Outcome='Success (drone ship)' And PAYLOAD_MASS__KG IN BETWEEN (5000 AND 6000)

 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "BETWEEN": syntax error
[SQL: select Booster_Version from SPACEXTBL where Landing_Outcome='Success (drone ship)' And PAYLOAD_MASS__KG IN BETWEEN (5000 AND 6000)]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Task 7




##### List the total number of successful and failure mission outcomes

In [84]:
%sql select count(Mission_Outcome) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(101,)]

In [66]:
%sql select count(Mission_Outcome) from SPACEXTBL where Mission_Outcome Like '%success%'

 * sqlite:///my_data1.db
Done.

[(100,)]

In [88]:
%sql select count(*) from SPACEXTBL where Mission_Outcome Like '%success%'

 * sqlite:///my_data1.db
Done.

[(100,)]

In [89]:
%sql select count(*) from SPACEXTBL where Mission_Outcome Like '%fail%'

 * sqlite:///my_data1.db
Done.

[(1,)]

In [70]:
%sql select distinct(Mission_Outcome) from SPACEXTBL where Mission_Outcome='%success%'

 * sqlite:///my_data1.db
Done.

[]

In [83]:
%sql select distinct(Mission_Outcome) from SPACEXTBL where Mission_Outcome Like '%success%'

 * sqlite:///my_data1.db
Done.

[('Success',), ('Success (payload status unclear)',), ('Success ',)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [125]:
%sql select Booster_Version,PAYLOAD_MASS__KG_ from SPACEXTBL where PAYLOAD_MASS__KG_=(select((PAYLOAD_MASS__KG_)) from SPACEXTBL) order by PAYLOAD_MASS__KG_

 * sqlite:///my_data1.db
Done.

[('F9 v1.0  B0003', 0), ('F9 v1.0  B0004', 0)]

In [109]:
%sql select Booster_Version,PAYLOAD_MASS__KG_ from SPACEXTBL where PAYLOAD_MASS__KG_=(select(MIN(PAYLOAD_MASS__KG_)) from SPACEXTBL) order by PAYLOAD_MASS__KG_

 * sqlite:///my_data1.db
Done.

[('F9 v1.0  B0003', 0), ('F9 v1.0  B0004', 0)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [6]:
%sql select Date,Landing_Outcome,Mission_Outcome from SPACEXTBL where Landing_Outcome = 'Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('2015-01-10', 'Failure (drone ship)', 'Success'),
 ('2015-04-14', 'Failure (drone ship)', 'Success'),
 ('2016-01-17', 'Failure (drone ship)', 'Success'),
 ('2016-03-04', 'Failure (drone ship)', 'Success'),
 ('2016-06-15', 'Failure (drone ship)', 'Success')]

In [32]:
#correct solution
%sql SELECT SUBSTR(DATE, 6, 2) AS MONTH, BOOSTER_VERSION, LAUNCH_SITE FROM SPACEXTBL WHERE LANDING_OUTCOME = 'Failure (drone ship)' AND SUBSTR(DATE,0,5) = '2015'

 * sqlite:///my_data1.db
Done.

[('01', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'F9 v1.1 B1015', 'CCAFS LC-40')]

In [18]:
%sql SELECT substr(Date,6,2) as month, Landing_Outcome, Booster_Version from SPACEXTABLE where Landing_Outcome = 'Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('20', 'Failure (drone ship)', 'F9 v1.1 B1012'),
 ('/2', 'Failure (drone ship)', 'F9 v1.1 B1015'),
 ('/2', 'Failure (drone ship)', 'F9 v1.1 B1017'),
 ('01', 'Failure (drone ship)', 'F9 FT B1020'),
 ('/2', 'Failure (drone ship)', 'F9 FT B1024')]

In [26]:
%sql select substr(Date,4,2) as month, Booster_Version, Landing_Outcome from Spacextbl where Landing_Outcome= 'Failure (drone ship)' and substr(0,1)='2015'

 * sqlite:///my_data1.db
Done.

[]

In [6]:
%sql SELECT Date from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('2010-06-04',),
 ('2010-12-08',),
 ('2012-05-22',),
 ('2012-10-08',),
 ('2013-03-01',),
 ('2013-09-29',),
 ('2013-12-03',),
 ('2014-01-06',),
 ('2014-04-18',),
 ('2014-07-14',),
 ('2014-08-05',),
 ('2014-09-07',),
 ('2014-09-21',),
 ('2015-01-10',),
 ('2015-02-11',),
 ('2015-03-02',),
 ('2015-04-14',),
 ('2015-04-27',),
 ('2015-06-28',),
 ('2015-12-22',),
 ('2016-01-17',),
 ('2016-03-04',),
 ('2016-04-08',),
 ('2016-05-06',),
 ('2016-05-27',),
 ('2016-06-15',),
 ('2016-07-18',),
 ('2016-08-14',),
 ('2017-01-14',),
 ('2017-02-19',),
 ('2017-03-16',),
 ('2017-03-30',),
 ('2017-05-01',),
 ('2017-05-15',),
 ('2017-06-03',),
 ('2017-06-23',),
 ('2017-06-25',),
 ('2017-07-05',),
 ('2017-08-14',),
 ('2017-08-24',),
 ('2017-09-07',),
 ('2017-10-09',),
 ('2017-10-11',),
 ('2017-10-30',),
 ('2017-12-15',),
 ('2017-12-23',),
 ('2018-01-08',),
 ('2018-01-31',),
 ('2018-02-22',),
 ('2018-03-06',),
 ('2018-03-30',),
 ('2018-04-02',),
 ('2018-04-18',),
 ('2018-05-11',),
 ('2018-05-22',),
 ('2018-06-04',),
 ('2018-06-29',),
 ('2018-07-22',),
 ('2018-07-25',),
 ('2018-08-07',),
 ('2018-09-10',),
 ('2018-10-08',),
 ('2018-11-15',),
 ('2018-12-03',),
 ('2018-12-05',),
 ('2018-12-23',),
 ('2019-01-11',),
 ('2019-02-22',),
 ('2019-03-02',),
 ('2019-05-04',),
 ('2019-05-24',),
 ('2019-06-12',),
 ('2019-07-25',),
 ('2019-08-06',),
 ('2019-11-11',),
 ('2019-12-05',),
 ('2019-12-17',),
 ('2020-01-07',),
 ('2020-01-19',),
 ('2020-01-29',),
 ('2020-02-17',),
 ('2020-03-07',),
 ('2020-03-18',),
 ('2020-04-22',),
 ('2020-05-30',),
 ('2020-06-04',),
 ('2020-06-13',),
 ('2020-06-30',),
 ('2020-07-20',),
 ('2020-08-07',),
 ('2020-08-18',),
 ('2020-08-30',),
 ('2020-09-03',),
 ('2020-10-06',),
 ('2020-10-18',),
 ('2020-10-24',),
 ('2020-11-05',),
 ('2020-11-16',),
 ('2020-11-21',),
 ('2020-11-25',),
 ('2020-12-06',)]

In [7]:
%sql select Landing_Outcome, substr(Date,1,4) as Year, substr(Date,6,2) as Month, Booster_Version, Launch_Site from SPACEXTBL where substr(Date,1,4)='2015' and Landing_Outcome='Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('Failure (drone ship)', '2015', '01', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('Failure (drone ship)', '2015', '04', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [28]:
%sql select Landing_Outcome, Date from SPACEXTBL where Landing_Outcome='Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('Success (ground pad)', '2015-12-22'),
 ('Success (ground pad)', '2016-07-18'),
 ('Success (ground pad)', '2017-02-19'),
 ('Success (ground pad)', '2017-05-01'),
 ('Success (ground pad)', '2017-06-03'),
 ('Success (ground pad)', '2017-08-14'),
 ('Success (ground pad)', '2017-09-07'),
 ('Success (ground pad)', '2017-12-15'),
 ('Success (ground pad)', '2018-01-08')]

In [39]:
%sql select count(Landing_Outcome) as Total_Landing_Outcome_bw from spacextbl where Date between '2010-06-04' and '2017-03-20'

 * sqlite:///my_data1.db
Done.

[(31,)]

In [50]:
%sql select Landing_Outcome,count(*) as Total_Landing_Outcome_bw from spacextbl where Date between '2010-06-04' and '2017-03-20' group by Landing_Outcome order by Total_Landing_Outcome_bw

 * sqlite:///my_data1.db
Done.

[('Precluded (drone ship)', 1),
 ('Failure (parachute)', 2),
 ('Uncontrolled (ocean)', 2),
 ('Controlled (ocean)', 3),
 ('Success (ground pad)', 3),
 ('Failure (drone ship)', 5),
 ('Success (drone ship)', 5),
 ('No attempt', 10)]

In [52]:
#correct answer
%sql SELECT Date,LANDING_OUTCOME, COUNT(*) AS QTY FROM SPACEXTBL WHERE DATE BETWEEN '2010-06-04' AND '2017-03-20' GROUP BY LANDING_OUTCOME ORDER BY QTY DESC

 * sqlite:///my_data1.db
Done.

[('2012-05-22', 'No attempt', 10),
 ('2016-04-08', 'Success (drone ship)', 5),
 ('2015-01-10', 'Failure (drone ship)', 5),
 ('2015-12-22', 'Success (ground pad)', 3),
 ('2014-04-18', 'Controlled (ocean)', 3),
 ('2013-09-29', 'Uncontrolled (ocean)', 2),
 ('2010-06-04', 'Failure (parachute)', 2),
 ('2015-06-28', 'Precluded (drone ship)', 1)]

In [41]:
%sql select landing_outcome

 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: select Landing_Outcome substr(Date,1,4), substr(Date,6,2),Booster_Version,Launch_Site from SPACEXTABLE where Landing_Outcome = 'Failure (drone ship)' and substr(Date,1,4)='2015']
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [16]:
SELECT DATE FROM SPACEXTBL WHERE DATE=select(MAX(DATE) from spacextbl

SyntaxError: invalid syntax (4051495370.py, line 1)

In [18]:

%sql SELECT max(Date) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('2020-12-06',)]

In [22]:
%sql select min(payload_mass__kg_) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(0,)]

In [23]:

%sql SELECT sum(PAYLOAD_MASS__KG_) as Total_Payload_Mass from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(619967,)]

In [12]:
%sql SELECT * FROM SPACEXTBL where DAYNAME(DATE)='Friday' LIMIT 5

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such function: DAYNAME
[SQL: SELECT * FROM SPACEXTBL where DAYNAME(DATE)='Friday' LIMIT 5]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>